# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'd12frosted/emacs-plus'

# Make sure apps get installed in system Applications dir
cask_args appdir: '/Applications'

# Install ZSH
brew 'zsh'
brew 'zsh-completions'

# Install GNU core utilities (those that come with OS X are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install Bash 4
brew 'bash'

# Install Binaries
brew 'tmux'
brew 'awscli'
brew 'hub'
brew 'tree'
brew 'mackup'
brew 'trash'
brew 'wget'
brew 'm-cli'

# Development
brew 'python'
brew 'ruby'
brew 'node'
brew 'pyenv'
brew 'pyenv-virtualenv'
brew 'rbenv'
brew 'the_silver_searcher'
brew 'ispell'
brew 'emacs-plus'

# Apps
cask '1password'
cask 'alfred'
cask 'ngrok'
cask 'aerial'
cask 'dropbox'
cask 'docker'
cask 'goofy'
cask 'google-chrome'
cask 'macdown'
cask 'sequel-pro'
cask 'slack'
cask 'sourcetree'
cask 'karabiner'
cask 'visual-studio-code'

# Fonts
cask 'font-meslo-lg-for-powerline'
cask 'font-sauce-code-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
